Repository: udevsharold/battsafepro
Catalog: battsafeproprefs/Resources/*.lproj/Localizable.strings
Languages: ar, cs, fr, ja, ko, zh_hans, zh_hant

# NOTI_MESSAGE
source: Stopped charging at %d%%
ar: لقد تم توقيف الشحن على مستوى %d%%.
cs: Zařízení se přestalo nabíjet po dosáhnutí %d%%
fr: Chargement arrêté à %d%%
ja: %d%%で充電を停止しました
ko: 충전 일시 정지됨 %d%%
zh_hans: 充电停止，已达到 %d%%
zh_hant: 充電停止，已達到 %d%%

# NOTI_CHARGE_NOW
source: Charge Now
ar: أشحن الآن
cs: Nabijte teď
fr: Charger maintenant
ja: 充電を再開
ko: 충전 시작
zh_hans: 恢复充电
zh_hant: 正在充電

source: Tweak
zh_hans: 插件
zh_hant: 外掛

# TWEAK_FOOTER
source: No respring is required for all changes made.
ar: ليس من الضروري إعادة تشغيل الـSpringboard بعد التغيير.
cs: Není nutný respring pro všechny změny nastavení
fr: Les changements ne nécéssitent pas un respring
ja: リスプリング無しで設定が適用されます
ko: 모든 설정에 리스프링이 필요하지 않습니다.
zh_hans: 所有设置修改无需注销。
zh_hant: 所有設定不需重新啟動主畫面。

source: Enabled
ar: تشغيل
cs: Zapnuto
fr: Activé
ja: 有効
ko: 활성화
zh_hans: 开启
zh_hant: 啟用

# SHOW_NOTIFICATION
source: Notification
ar: تنبيه
cs: Oznámení
ja: 通知する
ko: 알림
zh_hans: 推送通知
zh_hant: 顯示通知

# SHOW_NOTIFICATION_FOOTER
source: Notify when max charge level is reached.
ar: التنبيه عند الوصول إلى مستوى الشحن المحدّد.
cs: Oznámit při dosáhnutí maximální úrovně nabití
fr: Envoyer une notification quand la charge maximale est atteinte.
ja: 設定した充電量になると通知されます
ko: 최대 충전량에 다다르면 알립니다.
zh_hans: 充电到设置的最高电量后通知我。
zh_hant: 充電到設定的電量後通知。

source: Notification Style
ko: 알림 스타일
zh_hant: 通知風格

# NOTIFICATION_STYLE_DEFAULT
source: Default
ko: 기본
zh_hant: 預設

# NOTIFICATION_STYLE_COMPACT
source: Compact
ko: 작게
zh_hant: 密集

# NOTIFICATION_STYLE_FOOTER
source: Set notification style.
ko: 알림 스타일을 설정하세요.
zh_hant: 設定通知風格。

# NOTIFY_SILENTLY
source: Deliver Quietly
ar: إظهار بشكل صامت
cs: Doručovat potichu
fr: Notification silencieuses
ja: 通知バナーの表示なし
ko: 조용히 알리기
zh_hans: 静默通知
zh_hant: 無聲通知

# NOTIFY_SILENTLY_FOOTER
source: Notify without waking up the screen.
ar: إظهار دون تشغيل الشاشة
cs: Oznámit bez zapnutí obrazovky
fr: Notifier sans allumer l'écran.
ja: 通知センターのみに表示します
ko: 화면을 깨우지 않고 알립니다.
zh_hans: 在不唤醒屏幕的情况下进行通知。
zh_hant: 在不喚醒螢幕的情況下通知。

# NOTIFY_WITH_TONE
source: Alert Tone
ko: 알림 소리
zh_hans: 提示音
zh_hant: 通知鈴聲

# NOTIFY_WITH_TONE_FOOTER
source: Notify with alert tone.
ko: 알림 소리와 함께 알립니다.
zh_hans: 通知时发出提示音。
zh_hant: 通知時發出的聲音。

source: Max Charge Level
ar: أعلى مستوى شحن
cs: Maximální úrověň nabití
fr: Charge maximale
ja: 停止する充電量を設定
ko: 최대 충전 레벨
zh_hans: 最高电量
zh_hant: 最高電量

# MAX_CHARGE_LEVEL_FOOTER
source: Set maximum charging level (%). Default is 80%.
ar: قم بتحديد أعلى مستوى للشحن بالمئة (٪؜). الأصلي هو ٨٠٪؜.
cs: Nastavit maximální úroveň nabití v procentech. Výchozí je 80%.
fr: Définissez le niveau de charge maximale (%). Par défaut : 80%.
ja: 停止する充電量(%)を設定 デフォルトでは80%です
ko: 최대 충전 레벨을 설정합니다 (%). 기본 설정은 80% 입니다.
zh_hans: 设置最高充电电量(%)，默认为80% 。
zh_hant: 設定最高充電電量(%)，預設為80% 。

source: Development
ar: البرمجة
cs: Vývoj
fr: Développement
zh_hans: 插件开发
zh_hant: 開發

# SUPPORT
source: Support Development
ar: أدعم البرمجة
cs: Podpořit vývoj
fr: Aider le développement
ja: 開発者を支援する
ko: 개발자 후원하기
zh_hans: 支持开发者
zh_hant: 支持開發者

source: Contact
ar: التواصل
cs: Kontakty
fr: Contactes
ja: お問い合わせ
ko: 문의하기
zh_hans: 联系
zh_hant: 聯絡

source: Twitter
ar: تويتر
zh_hans: 推特
zh_hant: X (Twitter)

# FOOTER_CREATED
source: Created by udevs
ar: صنعه udevs
cs: Vytvořil udevs
fr: Créé par udevs
zh_hans: 由 udevs 开发
zh_hant: 由 udevs 開發

# FOOTER_CREDITS
source: Special thanks %@
ar: %@شكر خاص لـ
cs: Zvláštní poděkování %@
zh_hans: 特别感谢 %@
zh_hant: 特别感謝 %@

source: Respring
ar: إعادة تشغيل الـSpringboard
zh_hans: 注销
zh_hant: 重新啟動主畫面

# RESPRING_MESSAGE
source: Respring is not necessary, respring anyway?
ar: إعادة تشغيل الـSpringboard ليس ضروري. هل تريد فعله على أي حال؟
cs: Respring není nutný, opravdu respringout?
fr: Le respring n'est pas nécéssaire, respringer quand même ?
ja: リスプリングは必要ではありませんが、続けますか？
ko: 리스프링을 할 필요는 없습니다. 그래도 진행할까요?
zh_hans: 无需注销，要继续注销吗？
zh_hant: 無需重新啟動主畫面，要繼續嗎？

# ANSWER_YES
source: Yes
ar: نعم
cs: Ano
fr: Oui
ja: はい
ko: 네
zh_hans: 是的
zh_hant: 是

# ANSWER_NO
source: No
ar: لا
cs: Ne
fr: Non
ja: いいえ
ko: 아니요
zh_hans: 算了
zh_hant: 否

# ONBOARDING_SCREEN_SHOW
source: Show Onboarding Screen
ar: تبيين شاشة الدخول
cs: Ukázat vítací obrazovku
fr: Montrer l'écran de présentation
ja: 説明画面を表示
ko: 소개 화면 열기
zh_hans: 显示过充详情
zh_hant: 顯示充電詳情

# ONBOARDING_ALERT_SHOW
source: Show Onboarding Alert
ar: تبيين إنذار الدخول
cs: Ukázat vítací upozornění
fr: Montrer les alertes d'intégration
ja: 説明画面を表示
ko: 소개 화면 알림
zh_hans: 显示过充警告
zh_hant: 顯示充電過度警告

# OVERSHOOTING_HEADER
source: Overshooting
ar: التجاوز
cs: Přestřelování
fr: Surcharge
ja: 誤差について
ko: 과충전
zh_hans: 过充
zh_hant: 過度充電

# OVERSHOOTING_MESSAGE
source: Sometimes you'll notice that the charged percentage overshoot by around 1-2% more than the preferred max charge level and that's perfectly normal. iOS occasionally decides not to update the percentage until the next cycle, especially when the device is in very deep sleep. Moreover, the percentage that shows is just an estimation by iOS itself and is not absolute accurate numerically. However, BattSafePro has already trying its best in intelligently mitigating this.
ar: في بعض الحالات قد يتخطى الشحن المستوى المحدد بنسبة ١-٢٪؜ وهذا بسبب الطريقة التي يعتمدها الـiOS لقرئ مستوى الشحن، فإن هذا المستوى هو ليس دقيق تماماً. على الرغم من ذلك ‏نحن نحاول التخلص من هذه المشكلة.
cs: Občas si všimnete toho, že se baterie nabije o 1% až 2% více než nastavená maximální úrověň nabití, a to je normální. iOS se občas rozhodne neaktualizovat nabití baterie v jednom cyklu, obzvlášť když zařízení je ve stavu hlubokého spánku. Ještě k tomu je nabití baterie které iOS ukazuje pouze odhad a není úplně numericky přesné. BattSafePro se co nejvíce snaží inteligentně tot obejít.
fr: Vous pouvez remarquer que le pourcentage de la charge peut augmenter de 1 ou 2% de plus par rapport à la charge maximale définie, c'est tout à fait normale. iOS peut parfois décider de ne pas actualiser le pourcentage jusqu'au prochain cycle de charge, surtout quand l'appareil et en veille prolongé. Le pourcentage montré n'est qu'une estimation d'iOS et l'estimation n'est pas parfaite à 100%. Cependant, BattSafePro essaye déjà d'atténuer du meilleur qu'il peut sa propre estimation pour éviter de fausser les chiffres.
ja: iOSはデバイスがスリープ状態にある場合、一定時間充電残量を更新しないことがあります。さらに、表示される充電残量はおおよその数値であり、正確なものではありません。しかし、BattSafeProはこれをできる限り緩和するために最善を尽くしています。
ko: 때때로 배터리가 최대 충전 비율보다 약 1-2% 더 초과되어 충전되는 현상이 있으며, 이는 지극히 정상입니다. iOS는 기기가 아주 깊은 수면 상태일 때 다음 주기까지 백분율을 업데이트하지 않기로 결정하기도 합니다. 게다가, 이 비율은 iOS 자체의 추정일 뿐 절대 정확한 수치가 아닙니다. 그러나, BattSafePro는 이를 지능적으로 완화하기 위해 최선을 다하고 있습니다.
zh_hans: 有时您会注意到，充电百分比超过首选最大充电水平大约1-2％，这完全正常。iOS偶尔会在下一个充电周期前不更新百分比，尤其是在设备处于深度睡眠状态时。此外，显示的百分比仅是iOS本身的估算值，并不是绝对准确的数字，但是BattSafePro已经尽了最大的努力来缓解这种情况。
zh_hant: 您會發現到，有時充電百分比超過首選最大充電量約1-2％，這完全正常。iOS偶爾會在下一個充電周期前不更新百分比，尤其是在深度睡眠。此外，顯示的百分比僅是iOS本身的預算值，並不是絕對準確的數字，但是BattSafePro已經盡了最大的努力來緩解這種狀況。

# ANSWER_GOT_IT
source: Got it
ar: فهمت
cs: Chápu to
fr: Compris !
ja: 閉じる
ko: 알겠어요
zh_hans: 知道了
zh_hant: 知道了

# WELCOME_DESCRIPTION
source: Prolong your battery life
ar: طوّل حياة بطاريتك
cs: Zlepšete výdrž baterie
fr: Prolongez la vie de votre batterie
ja: バッテリーの寿命を延ばします
ko: 당신의 배터리 수명을 연장하세요.
zh_hans: 延长电池寿命
zh_hant: 延長電池壽命

# OPTIMIZED_CHARGING_HEADER
source: Optimized Charging
ar: الشحن بشكل محسّن
cs: Optimalizované nabíjení
fr: Charge optimisé
ja: 最適化されたバッテリー充電
ko: 최적화된 충전
zh_hans: 优化充电
zh_hant: 最佳化電池充電

# OPTIMIZED_CHARGING_MESSAGE
source: It's highly recommended to disable Apple's optimized charging for best experience.
ar: من الأفضل إطفاء خاصية الشحن المحسن الخاصة بآبل.
cs: Pro nejlepší zkušenost je nejlepší vypnout Optimalizované Nabíjení v nastavení.
fr: Il est grandement recommandé de désactivé la fonctionnalité de base d'Apple pour une meilleur expérience.
ja: 最適化されたバッテリー充電を無効にすることを強くおすすめします。
ko: 최상의 경험을 위해 최적화된 배터리 충전 비활성화를 강력 권장합니다.
zh_hans: 强烈建议禁用苹果的优化充电功能以获得最佳体验。
zh_hant: 强烈建議停用蘋果的最佳化電池充電功能以獲得最佳體驗。

# ACTIVATOR_SUPPORT_HEADER
source: Activator Support
ar: العمل مع Activator
cs: Podpora Activatoru
fr: Support d'Activator
ja: Activatorをサーポート
ko: Activator 지원
zh_hans: 支持Activator
zh_hant: 支援Activator

# ACTIVATOR_SUPPORT_MESSAGE
source: Activator is supported by BattSafePro. Get it for more personal customizations.
ar: Activator يشتغل مع BattSafePro. يمكنكم تنزيله للمزيد من طرق العمل
cs: BattSafePro podporuje Activator. Stáhněte si ho pro více možností přizpůsobení.
fr: Activator est supporté par BattSafePro. Utilisez-le pour une meilleur expérience et pour plus de customisation.
ja: BattSafeProはActivatorをサポートしているので、さらに便利にカスタマイズすることができます。
ko: BattSafePro는 Activator를 지원합니다. 더 많은 개인 설정을 확인해 보세요.
zh_hans: BattSafePro支持Activator，可以获取更多的个性化定制。
zh_hant: BattSafePro支援Activator，可以獲得更多的個人化手勢。

# DIAGNOSTIC_SCREEN_SHOW
source: Show Diagnostic Screen
ar: تبيين شاشة التشخيص
cs: Ukázat diagnostickou obrazovku
fr: Montrer l'écran de diagnostiques
ja: 診断画面を表示
ko: 진단 정보 표시하기
zh_hans: 显示诊断详情
zh_hant: 顯示診斷詳情

# DIAGNOSTIC_ALERT_SHOW
source: Show Diagnostic Alert
ar: تبيين إنذار التشخيص
cs: Ukázat diagnostické upozornění
fr: Montrer les alertes de diagnostiques
ja: 診断画面を表示
ko: 진단 정보 알림
zh_hans: 显示诊断警报
zh_hant: 顯示診斷警報

# DIAGNOSTIC_TITLE
source: Diagnostic Info
ar: معلومات حول التشخيص
cs: Diagnostika
fr: Informations de diagnostiques
ja: 診断情報
ko: 진단 정보
zh_hans: 诊断信息
zh_hant: 診斷訊息

# DIAGNOSTIC_DESCRIPTION
source: Overview of Current System Status If you experiencing any issue, reboot and rejailbreak instead of userspace reboot/ldrestart.
ar: تلخيص عن حالة النظام إذا كنت تواجه صعوبات عليك بالReboot وإعادة تشغيل الJailbreak بدلًا من الuserspace reboot/ldrestart
cs: Přehled stavu systému Pokud máte problémy, restartujte a znovu jailbreakněte místo userspace rebootu/ldrestartu.
fr: Aperçu du statut actuel du système. Si vous rencontrez un problème/une erreur, redémarrez et rejailbreakez votre iDevice au lieu de faire un LDrestart (un redémarrage sans perte de jailbreak)
ja: 現在のシステム状況 何か問題が発生した場合は、userspace reboot/ldrestartではなく、再起動して再脱獄をしてください。
ko: 현재 시스템 상태 확인 문제가 발생하면 userspace reboot/ldrestart 대신 재부팅 혹은 재탈옥을 시도하세요.
zh_hans: 当前系统状态概述 如果遇到任何问题，请重新越狱，而不是用户空间重启/软重启设备。
zh_hant: 當前系統狀況概述 如果遇到任何問題，請重新越獄，而不是使用者空間重新啟動/軟重新啟動設備。

# DIAGNOSTIC_BATTSAFEPRO_IN_EFFECT
source: BattSafePro in Effect
ar: BattSafePro يعمل.
cs: Stav BattSafuPro
fr: Etat de BattSafePro
ja: BattSafeProが稼働中
ko: BattSafePro 작동
zh_hans: BattSafePro正在运行
zh_hant: BattSafePro正在執行

# DIAGNOSTIC_CHARGING
source: Battery Currently Charging
ar: البطارية تشحن حاليًا
cs: Stav nabíjení baterie
fr: Batterie en charge
ja: バッテリー充電中
ko: 현재 배터리 충전 중
zh_hans: 电池当前正在充电
zh_hant: 正在充電

# DIAGNOSTIC_CHARGING_DESCRIPTION
source: Status update by system will take handful of seconds, keep refreshing.
ar: .تجديد الحالة سيأخذ بضعة ثوانٍ. تابع المحاولة.
cs: Aktualizace stavu bude trvat chvíli, pořád obnovujte
fr: Le rafraichissement de ce statut par le système peut prendre quelque secondes, vous pouvez rafraichir manuellement (si la batterie à atteint la charge maximale, ce statut sera désactivé).
ja: ステータスの更新には数秒かかります。更新を続けてください。
ko: 시스템 상태 업데이트는 몇 초 정도 소요됩니다. 계속 새로 고치세요.
zh_hans: 系统更新状态需要几秒钟，保持刷新中。
zh_hant: 系統更新狀態需要幾秒鐘，重新載入中。

# DIAGNOSTIC_CHARGING_PROHIBITED
source: Battery Charging Prohibited
ar: شخن البطارية ممنوع
cs: Stav zákazu nabíjení baterie
fr: Charge de la batterie terminé
ja: 充電停止中
ko: 배터리 충전 차단
zh_hans: 充电完成
zh_hant: 充電完成

# DIAGNOSTIC_EXTERNAL
source: External Source Connected
ar: الشاحن الخارجي موصول
cs: Externí zdroj připojen
fr: Source extèrne connecté
ja: 電源に接続
ko: 외부 장치 연결됨
zh_hans: 外接电源已连接
zh_hant: 外接電源已連接

# DIAGNOSTIC_EXTERNAL_CAPABLE
source: External Source Capable of Charging
ar: مصدر خارجي قادر على الشحن
cs: Schopnost externího zdroje nabíjet
fr: Source externe disponible pour le chargement
ja: 充電可能な電源に接続
ko: 충전이 가능한 외부 장치
zh_hans: 外接电源正在充电
zh_hant: 外接電源正在充電

# DIAGNOSTIC_BUTTON_REFRESH
source: Refresh
ar: إعادة التجديد
cs: Obnovit
fr: Rafraichir
ja: 更新
ko: 새로 고침
zh_hans: 刷新
zh_hant: 重新載入

# DIAGNOSTIC_BUTTON_CLOSE
source: Close
ar: إغلاق
cs: Zavřít
fr: Fermer
ja: 閉じる
ko: 닫기
zh_hans: 关闭
zh_hant: 關閉

source: Reddit
ar: ريدت
